package day09;

public class MethodPrac {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 * 조건선택연산자 (조건식 ? true : false)
		 * -조건식이 참이면 true,아니면 false를 선택,false에 값을 계속 넣어서 이어나갈수있음.
		 * 
		 * switch(값/식)
		 * 	-하나의 case가 끝나면 break.
		 * 
		 * 메서드는 public으로 선언.
		 * protected는 나 + 패키지 + 자식클래스만 사용가능.
		 * private는 나만 사용가능 (주로 멤버변수 선언할때 사용).
		 * 
		 * static는 메모리에 가장 먼저 올라가는 키워드
		 * 메서드에 static이 있으면 클래스메서드.
		 * 
		 * static이 있으면 객체 생성 없이 클래스메서드,클래스변수 호출가능.
		 * static 있으면 클래스명.메서드명(),클래스명.변수() 형태로 사용.
		 * 메서드는 하나의 기능만을 기준으로 만드는것을 원칙.
		 * 
		 * 접근제한자 class 클래스명 {
		 * } //클래스명은 반드시 대문자로 시작.
		 * 
		 * 변수,객체 메소드명은 소문자로 시작.
		 * 
		 *  객체 선언
		 *  클래스명 객체명 = new 클래스명();
		 *  
		 *  객체명.메서드명() 으로 사용.
		 *  객체명.멤버변수()는 일반적으로 멤버변수는 private로 선언되기때문에 호출 불가능.
		 *  get,set 함수를 생성하여 간접적으로 접근 가능.
		 *  
		 *  같은 클래스 안에서 메서드를 호출할때는 메서드명()으로 호출.
		 *  다른 클래스 안에서 호출시 객체명.메서드명()으로 호출.
		 */
	}

}
